{
  "title": "Tu Pokémob y tú",
  "author": "Thutmose",
  "pages": [
    {
      "lines": [
        "Tu Pokémob y tú",
        "",
        "§nÍndice{_ref_:_index_}",
        "",
        "§4§nInventario Pokémob{_link_:_inv_}",
        "   §4§nBotones{_link_:_btn_}",
        "   §4§nBarra de Hambre{_link_:_bar_}",
        "   §4§nObjeto de Utilidad{_link_:_held_}",
        "§2§nPantalla GUI (OSG){_link_:_osg_}",
        "   §2§nUso de Ataques{_link_:_moves_}",
        "§5§nCuidados Pokémob{_link_:_care_}",
        "§7§nFAQ{_link_:_faq_}",
        "",
        "§4§nInventario Pokémob{_ref_:_inv_}{_link_:_index_}",
        "",
        "§4Dar clic derecho a tu Pokémob desplegará el inventario de tu Pokémob. Este inventario dispone de 6 botones, 7 espacios y la barra de hambre, puedes renombrar tu Pokémob escribiendo en la caja de texto de la parte superior del inventario (Donde se encuentra su nombre).",
        "",
        "§4§nBotones de Inventario{_ref_:_btn_}{_link_:_index_}",
        "",
        "§4Los botones debajo de la barra de hambre controlan la postura de tu Pokémob. Si el texto es rojo significa que la postura está desactivada y si es verde está activada. El botón AI es para un control más detallado sobre las acciones de tu Pokémob. El botón ST controla las ubicaciones de los cofres donde tu Pokémob debe buscar objetos o frutas, y el botón RT controla rutas para que tu Pokémob patrulle.",
        "",
        "§4Sobre los botónes de postura, El botón superior le indíca sentarse, el del medio esperar, y el inferior proteger. LosPokémobs en modo de espera actuarán como salvajes, es decir, no te seguirán ni obedecerán ordenes (no verás su OSG{_link_:_osg_}). Pokémobs en modo proteger intentarán matar cualquier cosa que se les acerque y, generalmente no seguirán tus ordenes ya que intentarán defenderte lo mejor que puedan con sus habilidades.",
        "",
        "§4§nBarra de Hambre{_ref_:_bar_}{_link_:_index_}",
        "",
        "§4La barra de hambre está localizada sobre los 3 botónes de postura, esta barra se agota cuando tu pokemon tiene hambre. Cuando este indicador baja hasta 1/3 tu Pokémob comenzará a recibir daño. Puedes rellenar la barra de hambre alimentando a tu Pokémob al poner frutas(berries) en los 5 espacios que están sobre ella o curandolo en el centro pokémob. Si a tu Pokémob no le gustan las berries con que lo alimentas igualmente se recuperará del hambre pero perderá felicidad.",
        "",
        "§4§nMontura y ranura de utilidad{_ref_:_held_}{_link_:_index_}",
        "",
        "§4La ranura superior izquierda es para la montura. Si pones una montura aquí y tu Pokémob es lo suficientemente grande serás capaz de montarlo. Si ya tiene una montura deberas agacharte y apretar clic derecho en él para poder abrir el inventario.",
        "",
        "§4La ranura de utilidad está ubicada bajo la ranura de la montura. Esta ranura es donde pones el objeto de utilidad de tu Pokémob. Diferentes objetos tienen diferentes efectos aquí. Por ejemplo, las berries que sean comidas durante una batalla les proveerán de sus efectos.",
        "",
        "§2§nPantalla GUI (PG){_ref_:_osg_}{_link_:_index_}",
        "",
        "§2La PG solo se mostrará para Pokémobs que no estén en modo sentado o de espera. Ella muestra la barra de salud, EXP, Estado y Movimientos, y es usada para elegir que ataque usará tu Pokémob en combate.",
        "",
        "§2El estado es mostrado en una pequeña caja en la parte inferior izquierda de la imagen, y la salud es la barra verde/roja debajo del nombre.",
        "",
        "§2La Experiencia (EXP) es la barra pequeña debajo de la barra de salud, se rellena de azul cuando tu Pokémob gana EXP.",
        "",
        "§2Puedes cambiar tu ataque seleccionado presionando las flechas de arriba o abajo, el ataque seleccionado se muestra destacado en azul.",
        "",
        "§2Si selecionas el último ataque y presionas abajo o el primero y presionas arriba ningún ataque será seleccionado y tu Pokémob no atacará.",
        "",
        "§2Tener ningún ataque selecionado puede ayudar si intentas capturar un Pokémob debilitado. Como puedes elegír no atacar tu Pokémob no lo matará.",
        "",
        "§2El número a la derecha del nombre indíca la cantidad de Pokémobs que tienes desplegados y que no están ni sentados ni en modo de espera..",
        "",
        "§2Si presionas izquierda o derecha te mostrará los Pokémobs y al que tengas selecionado actualmente. Solo el Pokémob seleccionado recibirá ordenes.",
        "",
        "§2§nUsando Movimientos{_ref_:_moves_}{_link_:_index_}",
        "",
        "§2Si tienes un ataque selecionado puedes decirle a tu Pokémob que lo use presionando G.",
        "",
        "§2Si estás mirando a un mob o jugador cuando lo hagas tu Pokémob lo atacará.",
        "",
        "§2Si encambio estás mirando un bloque tu Pokémob intentará usar su habilidad en ese bloque.",
        "",
        "§2Algunos ataques tienen efectos fuera de la batalla. Usar ataques hace que a tu Pokémob le de hambre más rápido, así que asegurate de alimentarlo o curarlo en el centro pokémob regularmente.",
        "",
        "§5§nCuidados Pokémob{_ref_:_care_}{_link_:_index_}",
        "",
        "§5Si tu Pokémob se lastima, una vez termine la batalla si está fuera de su pokecubo, se recuperará lentamente mientras no tenga hambre. En cambio, los Pokémobs hambrientos irán perdiendo vida hasta morir de hambre. Para mantener a tu Pokémob alimentado puedes darle berries o curarlo en el centro pokémob. Algunos Pokémobs también pueden comer varias otras cosas, y tal vez no tengan hambre tan a menudo.",
        "",
        "§5Si tu Pokémob se desmaya, puedes revivirlo curandolo en el centro Pokémob, Lanzalo al PC presionando Q o creandolo con una Revive. ",
        "",
        "§5Solo la máquina de curación del centro Pokemob recuperá también su hambre.",
        "",
        "§5Los Pokémobs dejados fuera de sus pokecubos perderán lentamente felicidad con el tiempo.  Los Pokémobs también ganan felicidad cuando comen una berry que les guste. Si tienen que comer una que no les guste su felicidad desminuirá. Su felicidad también cae si están hambrientos o se desmayan.",
        "",
        "§7§nFAQ{_ref_:_faq_}{_link_:_index_}",
        "",
        "§7Q: Como mando a mi Pokémob a su pokecubo?",
        "§7A: Asegúrate que no está sentado ni en modo de espera, luego presiona R, o usa el comando /pokerecall",
        "",
        "§7Q: Como alimento a mi Pokémob?",
        "§7A: Pone berries en las 5 ranuras principales de su inventario.",
        "",
        "§7Q: Por qué mi Pokémob comienza a recibir daño y morir?",
        "§7A: Tu Pokémob está probablemente muerto de hambre, asegúrate de tenerlo bien alimentado!",
        "",
        "§7Q: Como subo o bajo cuando estoy montando un Pokémob?",
        "§7A: Presiona espacio para subir y control izquierdo para bajar. Puedes asignar otras teclas de acceso rápido para esto.",
        "",
        "§7Q: Mi Pokémob no me sigue y está deambulando por alguna parte, qué hago?",
        "§7A: Probablemente tu Pokémob está en modo espera, apaga este modo a través de su botón de inventario.{_link_:_btn_}",
        ""
      ]
    }
  ]
}