{
  "title": "你的宝可梦与你",
  "author": "Thutmose",
  "pages": [
    {
      "lines": [
        "你的宝可梦与你",
        "",
        "§n目录{_ref_:_index_}",
        "",
        "§4§n宝可梦物品栏{_link_:_inv_}",
        "   §4§n物品栏按钮{_link_:_btn_}",
        "   §4§n饱食度{_link_:_bar_}",
        "   §4§n持有物{_link_:_held_}",
        "§2§n屏显界面 (OSG){_link_:_osg_}",
        "   §2§n使用招式{_link_:_moves_}",
        "§5§n照顾宝可梦{_link_:_care_}",
        "§7§n常见问题{_link_:_faq_}",
        "",
        "§4§n宝可梦物品栏{_ref_:_inv_}{_link_:_index_}",
        "",
        "§4右键单击你的宝可梦会显示它的物品栏。它包含 6 个按钮、7 个格子和饱食度条，你可以通过在物品栏左上角输入名称文本来重新命名这只宝可梦。",
        "",
        "§4§n物品栏按钮{_ref_:_btn_}{_link_:_index_}",
        "",
        "§4饱食度条下方的按钮控制着宝可梦的行动模式，如果文本为红色，则该状态为关闭，如果为绿色，则为开启。 AI 按钮用于更好地控制宝可梦的动作。 ST 按钮控制你的宝可梦使用物品的位置，而 RT 按钮控制你的宝可梦巡回的路径。",
        "",
        "§4对于行动模式按钮，上面是“坐下”，中间是“徘徊”，下面是“守卫”。处于“徘徊”状态的宝可梦会像野生宝可梦那样，不会跟从你也不会听从指挥 (你看不见他们的 屏显界面{_link_:_osg_} )。处于“守卫”状态的宝可梦也不会听从你的指挥，它们会试图击败接近的一切生物，为了竭尽所能保护你。",
        "",
        "§4§n饱食度{_ref_:_bar_}{_link_:_index_}",
        "",
        "§4饱食度条位于行动模式按钮上方，当你的宝可梦饿了，饱食度条会耗尽，当它降低到大约 1/3 时，你的宝可梦将开始受到伤害。要补充饱食度，将树果放在宝可梦的物品栏中，或是在宝可梦中心治疗它们。如果你的宝可梦不喜欢你喂它的树果，它虽然会补充饱食度，但会变得不快乐。",
        "",
        "§4§n上鞍和持有物品{_ref_:_held_}{_link_:_index_}",
        "",
        "§4左上方的格子用于放置马鞍。如果你在这里放置马鞍，并且这只宝可梦足够大，那么你就可以骑在它上面。如果宝可梦有鞍，那么打开其物品栏需要潜行。",
        "",
        "§4最左下方的格子用于放置持有物。不同的物品在这里有不同的效果，例如树果可以在战斗中被吃掉，以使其生效。",
        "",
        "§2§n屏显界面 (OSG){_ref_:_osg_}{_link_:_index_}",
        "",
        "§2屏显界面只有在宝可梦没有设置“坐下”或“徘徊”行动模式时出现。屏显界面会显示宝可梦的血量、经验值、状态和招式，也用于在战斗过程中选择该出哪招。",
        "",
        "§2宝可梦图像左下方的小框显示宝可梦的状态，名称下方的绿色/红色条是宝可梦的血量。",
        "",
        "§2血条下方的小条是经验条，在获得经验时它会变蓝。",
        "",
        "§2你可以按上下键切换宝可梦的招式，蓝色高亮即为要出的招式。",
        "",
        "§2在最后一个招式按下或在第一个招式按上，就可以不选择招式，这样你的宝可梦就不会出招了。",
        "",
        "§2如果你试图捕捉虚弱的宝可梦，不选择招式会有所帮助，因为这样你的宝可梦就不会误杀它了。",
        "",
        "§2名称右侧的数字显示尚未设置“徘徊”或“坐下”的宝可梦数量。",
        "",
        "§2如果你按下箭头左右键，可以选择不同的宝可梦。   只有当前选中的宝可梦会听从命令。",
        "",
        "§2§n使用招式{_ref_:_moves_}{_link_:_index_}",
        "",
        "§2如果你选择了一个招式，你可以通过按 G 来让你的宝可梦使用它。",
        "",
        "§2如果你这样做时正在看其它生物或玩家，你的宝可梦会攻击它。",
        "",
        "§2相反，如果你这样做时看着一个方块，那么你的宝可梦会尝试对这个方块使用招式。",
        "",
        "§2有些招式在战斗之外有效果。使用招式会让你的宝可梦饿得更快，所以一定要让它吃饱，或者定期在宝可梦中心治疗它。",
        "",
        "§5§n照顾宝可梦{_ref_:_care_}{_link_:_index_}",
        "",
        "§5如果你的宝可梦受伤了，一旦它不再战斗，并且在精灵球之外，只要它不饿，它就会慢慢回血。相反，饥饿的宝可梦会受到伤害，直到它们饿死。为了让你的宝可梦吃饱，你需要给它们喂浆果，或者在宝可梦中心定期治疗它们。一些宝可梦还可以吃其他各种东西，并且不会那么经常饿。",
        "",
        "§5如果你的宝可梦战败了，那么你可以把它带到宝可梦中心以治疗它，把它放进电脑 (也可以使用 Q 丢进去) 或把宝可梦和复活药一起放在合成栏。",
        "",
        "§5在宝可梦中心治疗同时也会恢复饱食度。",
        "",
        "§5随着时间的推移，在球外的宝可梦会慢慢获得快乐，宝可梦吃到自己喜欢的树果也会获得快乐。然而，如果它们不得不吃他们讨厌的食物，它们的快乐感就会下降。如果它们饿死或战败，他们的快乐感也会下降。",
        "",
        "§7§n常见问题{_ref_:_faq_}{_link_:_index_}",
        "",
        "§7Q: 如何把宝可梦召回到精灵球中?",
        "§7A: 确保它不在“坐下”或“徘徊”行动，按下 R 键就可以了。",
        "",
        "§7Q: 如何喂食宝可梦?",
        "§7A: 在 5 个主物品栏中放置树果。",
        "",
        "§7Q: 为什么宝可梦开始缓慢掉血直到失败?",
        "§7A: 它应该是饿了，赶快喂它树果吃!",
        "",
        "§7Q: 在骑乘宝可梦时，如何向上/向下飞?",
        "§7A: 按空格向上，左侧 Ctrl 向下。也可以改成其它按键。",
        "",
        "§7Q: 我的宝可梦不会跟着我，并且一直在其它某个地方徘徊，我该怎么办？",
        "§7A: 它的行为模式大概被设为了“徘徊”，在 物品栏按钮{_link_:_btn_} 中把它关掉。",
        ""
      ]
    }
  ]
}
